tut/13/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

backgroundMesh
{

	xMin -1000;
	xMax 1200;
	yMin -1000;
	yMax 1200;
	zMin 0;
	zMax 1000;
	xCells 20;
	yCells 20;
	zCells 50;
}

vertices
(
    ( $backgroundMesh/xMin $backgroundMesh/yMin $backgroundMesh/zMin)
    ( $backgroundMesh/xMax $backgroundMesh/yMin $backgroundMesh/zMin)
    
    ( $backgroundMesh/xMax $backgroundMesh/yMax $backgroundMesh/zMin)    
    ( $backgroundMesh/xMin $backgroundMesh/yMax $backgroundMesh/zMin)
    
    ( $backgroundMesh/xMin $backgroundMesh/yMin $backgroundMesh/zMax)
    ( $backgroundMesh/xMax $backgroundMesh/yMin $backgroundMesh/zMax)
    
    ( $backgroundMesh/xMax $backgroundMesh/yMax $backgroundMesh/zMax)
    ( $backgroundMesh/xMin $backgroundMesh/yMax $backgroundMesh/zMax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) 
        ($backgroundMesh/xCells $backgroundMesh/yCells $backgroundMesh/zCells) 
        simpleGrading (1 1 10)
);

edges
(
);

boundary
(
    sides
    {
        type symmetry;
        faces
        (
            (3 2 6 7)
    	    (0 1 5 4)
        );
    };
   
    outlet
    {
    	type patch;
    	faces
    	(
    	    (2 1 5 6)
    	);
    }
    inlet
    {
     	type patch;
    	faces
    	(
    	    (3 0 4 7)
    	); 
    }
    
    top
    {
    	type patch;
    	faces
    	(
    	    (6 7 4 5)
    	);
    }
    
    ground
    {
    	type wall;
    	faces
    	(
    	    (3 2 1 0)
    	);  
    }
);

// ************************************************************************* //
