tut/13/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (3 0 0);
 
boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
    	type    fixedValue;
        value   uniform (3 0 0 );
    }
    outlet
    {
    	type    zeroGradient;
    }
    top
    {
    	type    slip;
    }
    ground
    {
        type    noSlip;
    }
    tower1
    {
        type    noSlip;
    }
    tower2
    {
        type    noSlip;
    }
}


// ************************************************************************* //
