tut/13/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
    	type    calculated;
    	value	$internalField;
    }
    outlet
    {
    	type    calculated;
    	value	$internalField;
    }
    top
    {
    	type    calculated;
    	value	$internalField;
    }
    ground
    {
    	type    calculated;
    	value	$internalField;
    }
    tower1
    {
    	type    calculated;
    	value	$internalField;
    }
    tower2
    {
    	type    calculated;
    	value	$internalField;
    }

}


// ************************************************************************* //
