tut/13/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet
    {
    	type    calculated;
    	value	$internalField;
    }
    outlet
    {
    	type    calculated;
    	value	$internalField;
    }
    top
    {
    	type    calculated;
    	value	$internalField;
    }
    ground
    {
        type    compressible::alphatWallFunction;
        value   uniform 0;
    }
    tower1
    {
        type    compressible::alphatWallFunction;
        value   uniform 0;
    }
    tower2
    {
        type    compressible::alphatWallFunction;
        value   uniform 0;
    }
    
}


// ************************************************************************* //
