tut/13/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet
    {
    	type    fixedValue;
    	value	$internalField;
    }
    outlet
    {
    	type    zeroGradient;
    }
    top
    {
    	type    zeroGradient;
    }
    ground
    {
    	type    zeroGradient;
    }
    tower1
    {
    	type    zeroGradient;
    }
    tower2
    {
    	type    zeroGradient;
    }

}


// ************************************************************************* //
