tut/13/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-5;

boundaryField
{	
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
    	type    calculated;
    	value	$internalField;
    }
    outlet
    {
    	type    calculated;
    	value	$internalField;
    }
    top
    {
    	type    calculated;
    	value	$internalField;
    }
    ground
    {
        type    nutkWallFunction;
    	value	$internalField;
    }
    tower1
    {
        type    nutkWallFunction;
    	value	$internalField;
    }
    tower2
    {
        type    nutkWallFunction;
    	value	$internalField;
    }

}


// ************************************************************************* //
